{
  "posts": [
    {
      "id": "ac5cbcd6-af05-4300-910a-ba082af1342a",
      "__typename": "Post",
      "title": "Real-Time Winter Storm Updates, Road And Safety Information",
      "content": {
        "html": "<p>GREENSBORO, N.C. (WFMY) -- The entire WFMY News 2 viewing area is under either a Winter Storm Warning or a Winter Weather Advisory Monday.</p><p>MONDAY, December 10, 2018:</p><p>7:25 a.m. - Some storm impact by the numbers: WNCN reports the North Carolina Highway Patrol responded to 709 crashes and 1,892 calls for service from midnight to 3 p.m. Sunday. NC DOT crews used more than 13,000 tons of salt and 1,600 tons of salt and sand mixture to clear roads.</p><p>6:15 a.m. - High Point 911 has posted photos of a collapsed vacant building on English Road.</p><p>5:45 a.m. - Latest power outage numbers for our area:</p><p>Guilford: 8,897</p><p>Forsyth: 2,710</p><p>Rockingham: 3,544</p><p>Randolph: 4,554</p><p>Alamance: 2,630</p><p>Stokes: 2,997</p><p>Surry: 2,386</p><p>Davidson: 323</p><p>5 a.m. - There are major delays on I-77 between Exit 82 (NC-67) near Elkin and the Virginia state line. Both directions are reduced to one lane.</p><p>4 a.m. - Crews are out clearing roads in Greensboro. And the flakes are coming down again in Kernersville.</p><p>2:30 a.m. - The latest power outage totals for local counties from the state department of public safety -</p><p>Guilford: 8,429</p><p>Forsyth: 3,042</p><p>Rockingham: 2,459</p><p>Randolph: 4,251</p><p>Alamance: 2,586</p><p>Stokes: 3,399</p><p>Surry: 2,463</p><p>Davidson: 343</p><p>SUNDAY, December 9, 2018:</p><p>11:15pm - More than 7,000 without power in Greensboro.</p><p>11:00pm - Greensboro police announce Gallimore Dairy Road closed possibly for the next 12 hours between Chimney Rock Road and I-40, due to a disabled tractor-trailer in the roadway. Drivers are asked to avoid this area.</p><p>10:00pm - Power outages drop for Winston-Salem, increase in Greensboro.</p><p>9:00pm - Snow changes to mostly sleet, wintry mix.</p><p>8:00pm - Power outages increase significantly for Winston-Salem at more than 5,000.</p><p>7:00pm - Ice accumulating on cars and trees.</p><p>6:30pm - 12-year-old on a sled being pulled by ATV injured after he hits a pole.</p><p>6pm - One death confirmed in Matthews, NC after a tree falls on a car. Investigators also confirmed a tractor trailer driver is missing after his truck went into the Neuse River. The search for the driver has been suspended.</p><p>5:37pm - Durham Co. deputy's windshield cracked after a chunk of ice fell from an overpass.</p><p>5pm: Red cross opens more shelters.</p><p>4pm - More and more drivers are having to be rescued. WFMY News 2 Erica Stapleton's video from Winston-Salem back to Greensboro on I-40 shows no matter if you have 4-wheels or 18, this snow owns the roads.</p><p>3pm - NC Zoo says it will be closed through Tuesday, December 11.</p><p>2pm - NC Highway Patrol continues to caution drivers about being on the roads as conditions continue to deteriorate.</p><p>1pm - Power outages increase. Calls for service to Highway Patrol or 911 centers also increase.</p><p>Noon - The majority of school systems across the Triad and NC are CLOSED Monday.</p><p>12:00am - Snow starts in Greensboro, other parts of the Triad.</p><p>5:00am - Snow building up in areas across the Triad.</p><p>7:00am- Just over 2,000 power outages on the Duke Energy map.</p><p>8:00am - Lots of crashes being reported at the I-85/40 split in Greensboro, between Randleman Road and South Elm Eugene Street Exits.</p><p>9:45am - Greensboro Coliseum announces the Trans-Siberian Orchestra Concert is rescheduled to Tuesday, December 11.</p><p>10:00am - Power outages increase. Winston-Salem has the most of around 4,000.</p><p>10:30am- Several Triad schools make the call to close Monday.</p><p>11:00am - Governor Cooper does update and warns about any type of traveling. First responders are dealing with hundreds of wrecks.</p><p>11:10am - Guilford County leaders declare a State of Emergency for the entire county.</p><p>Latest List: Snow Closings</p><p><span style=\"color: rgb(119, 119, 119);\">Saturday</span></p><p>8:19 a.m. -- Duke Energy Midwest crews traveling to Greensboro to aid in winter storm efforts.</p><p>12:00 p.m. -- Governor Roy Cooper gives an update on the major winter storm expected to hit the Triad.</p><p>STATE OF EMERGENCY</p><p>Gov. Roy Cooper has issued a state of emergency for all 100 counties in North Carolina</p><p>The Governor declared the State of Emergency in an effort to get any essential supplies, equipment, and utility trucks to restore power to get where they are needed quickly. He has also activated the National Guard in addition to declaring the State of Emergency.</p><p>Related: 'State of Emergency' To Be Declared in NC Ahead of Major Winter Storm; National Guard Activated</p><p><span style=\"color: rgb(119, 119, 119);\">POWER OUTAGES</span></p><p>Duke Energy is projecting the winter storm could result in 500,000 plus power outages in the Carolinas. Widespread, multiple-day power outages are expected for the Mountains, Foothills, Piedmont, Triad and Triangle areas of North Carolina. Duke Energy has more than 8,700 line and tree workers, damage assessors and support personnel ready to respond to outages.</p><p>Related: 500,000 Plus Power Outages Expected With Winter Storm: Duke Energy</p><p><span style=\"color: rgb(119, 119, 119);\">REPORTING DUKE ENERGY OUTAGES</span></p><p>Here's how to report a power outage:</p><p>• Text OUT to 57801 (standard text and data charges may apply)</p><p>• Call the automated outage-reporting system at 1-800-POWERON, 1-800-769-3766 for Duke Energy Carolinas customers and 800-419-6356 for Duke Energy Progress customers.</p><p>• Report an outage or view current outages online at www.dukeenergyupdates.com</p>"
      },
      "publishedAt": "2018-12-10T13:11:13.622Z",
      "tag": ["animals", "travel", "React"]
    },
    {
      "id": "7ec2de3e-d05a-4e78-8084-85dfc83a432a",
      "__typename": "Post",
      "title": "Bears vs. Rams Live Blog: Score, highlights, analysis from NFL Week 14 game",
      "content": {
        "html": "<p>Bears vs. Rams Live Blog: Score, highlights, analysis from NFL Week 14 game originally appeared on nbcsportschicago.com</p><p>Welcome back, gang.&nbsp;</p><p>Here's a game that needs very little introduction. 11-1 Rams, 8-4 Bears, Sunday Night at Soldier, Offense Vs. Defense, etc. Buckle up, strap in, follow whatever&nbsp;euphemism you enjoy the most.&nbsp;</p><p>As always,&nbsp;J.J. Stankevitz&nbsp;will be your eyes and ears from Soldier;&nbsp;give him&nbsp;a follow.&nbsp;Lorin Cox's&nbsp;tweets are also worth your time.&nbsp;</p><p>You can stream the game right here!</p><p>Also this is a wonderful time to remind you that you can&nbsp;Click here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of the Bears and stream the ‘Football Aftershow' easily on your device.</p><p><span style=\"color: rgb(119, 119, 119);\">4th Quarter</span></p><p>1033-&nbsp;And we'll leave you with this. It's been real, gang:</p><p>1024 -&nbsp;</p><p>1017-&nbsp;Everything's coming up Bears now. On 4th and 4, Akiem Hicks gets to Goff for a sack. Bears take over on downs at the Rams' 25. A TD here probably ices it for Chicago.&nbsp;</p><p>1002-&nbsp;Doink! Zuerline boinks it off the uprights and the Rams come up empty.&nbsp;</p><p>953-&nbsp;Todd Gurley has 20 yards rushing. That's all.&nbsp;</p><p><span style=\"color: rgb(119, 119, 119);\">3rd Quarter</span></p><p>940 -&nbsp;This game is SLOPPY. Trubisky throws his 3rd INT of the night and Kyle Fuller immediately bails him out. Everyone gets an interception!&nbsp;</p><p>922 -&nbsp;TOUCHDOWN BEARS.&nbsp;BIG GUY TD.&nbsp;9 plays, 81 yards, 4:16. Capped off by Trubisky 2 yard touchdown&nbsp;to ... Bradley Sowell?&nbsp;BEARS 15, RAMS 6.&nbsp;</p><p>922-&nbsp;</p><p>912-&nbsp;SAFETY! Eddie Goldman gets to Goff in the Rams' endzone and it's two points to start the half.&nbsp;BEARS 8, RAMS 6.&nbsp;</p><p><span style=\"color: rgb(119, 119, 119);\">2nd Quarter</span></p><p>856 -&nbsp;as the first half ends, some stats to lose sleep over:</p><p>850 -&nbsp;</p><p>840 -&nbsp;well this is not the best news in the world:</p><p>835 -&nbsp;Rams stall out at the 30, but kick a 50 yard field goal to tie it up. Lots of play between the 20's tonight.&nbsp;BEARS 6, RAMS 6.&nbsp;</p><p>825 -&nbsp;Rams run a fake punt on 4th and 8 and convert. Not ideal!&nbsp;</p><p>815 -&nbsp;Cody Parkey nails a 31-yard field goal. Not exactly what you want when you get the ball in the redzone to start a drive, but a lead is a lead.&nbsp;BEARS 6, RAMS 3.&nbsp;</p><p>811-&nbsp;Roquan Smith! The rookie LB intercepts Goff in the Bears' red zone and all of a sudden Chicago's in business.&nbsp;</p><p><span style=\"color: rgb(119, 119, 119);\">1st Quarter</span></p><p>745 -&nbsp;FIELD GOAL BEARS.&nbsp;Parkey hits it from 39 and it's all tied up.&nbsp;BEARS 3, RAMS 3.&nbsp;</p><p>733 -&nbsp;Khalil Mack breaks up the play on 3rd down and the Rams settle for 3. Not a bad defensive stand for Chicago.&nbsp;RAMS 3, BEARS 0.&nbsp;</p><p>730 -&nbsp;Trubisky's back! A few nice runs and then an overthrow that turned into a Marcus Peter INT. All is right in the world again.&nbsp;</p><p>725 -&nbsp;The Bears will recieve the ball to start the game and Anthony Miller takes it out to the 20. Trubisky runs for 9 and we're off!&nbsp;</p><p><span style=\"color: rgb(119, 119, 119);\">Pregame</span></p><p>Inactives are out! Check 'em out right here.&nbsp;</p>"
      },
      "publishedAt": "2018-12-10T13:11:56.024Z",
      "tag": ["animals", "learning", 
      "CMS", "React"]
    },
    {
      "id": "b881c410-3fd2-4e75-b328-586fd373729e",
      "__typename": "Post",
      "title": "Joe’s Weather Blog: Milder interludes between storms (SUN-12/9)",
      "content": {
        "html": "<p>Good afternoon…another cold day out there with temperatures struggling to get to 32° early this afternoon. Th eskies are sunny though but without any wind to speak of (good thing and bad thing) there is nothing to really stir the air up all that much. As a result we are left to a weakening December sun to warm things up from our cold lows this morning. Hence the reason why we’re struggling today. Tomorrow will be a bit closer to average and then finally on Tuesday we’ll pop into the 50s. There are storms out there to track…one Wednesday…one Thursday…maybe something later next weekend…and more beyond that. The pattern is an active one and that means some temperature swings coming BUT there are no arctic air intrusions on the way for quite some time…perhaps even till Christmas week…but we will be on borrowed time I think for the last 10 days of December.</p><p>Tonight: Fair skies and seasonable with lows in the teens to near 20°</p><p>Monday: Mostly sunny and seasonable with highs in the 30s to near 40°</p><p>Tuesday: Windy and warmer with highs in the 50-55° range. Winds may gust to 35 MPH</p><p>Well there have been some big snows in parts of the country over the past 24 hours or so. Lubbock, TX had close to 10″ of snow…their average for an entire winter is 8.2″. Their December record is 10.5″ and there may be another snowmaker for them this week.</p>"
      },
      "publishedAt": "2018-12-10T13:12:28.089Z",
      "tag": ["animals"]
    },
    {
      "id": "f3f601f9-1df7-481c-a2bb-4bc5ddc2bbfd",
      "__typename": "Post",
      "title": "Police Dog Shows These Boots Are Not Made For Walking",
      "content": {
        "html": "<p>South Dakota winters can be brutal, with an average annual snowfall of 41 inches. So, the Rapid City Police Department decided to provide some protection for its Belgian Malinois police dog, Jary, in the form of winter boots, according to a post on the department’s Facebook page.</p><p>But when a K-9 officer put the boots on Jary for the first time, it was immediately obvious the dog was not a fan of the protective gear. Even though he tried on the boots indoors, his gait looked as if he were trudging through big snow drifts.</p><p>And after the police department posted video of the dog’s first tentative steps on social media, it’s fair to wonder if Jary was more chagrined by having to wear the boots or by the national notoriety that followed.</p><p>Check out the entire police department video below:</p>"
      },
      "publishedAt": "2018-12-10T13:15:00.254Z",
      "tag": ["React"]
    },
    {
      "id": "cd4144e4-bbfe-4329-9495-4904f22bcdf4",
      "__typename": "Post",
      "title": "Investigators: Woman drowned in icy pond while trying to rescue her dog",
      "content": {
        "html": "<h2>Investigators: Woman drowned in icy pond while trying to rescue her dog</h2><p><br></p><p><br></p><p>Investigators: Woman drowned in icy pond while trying to rescue her dog</p><p>A Michigan woman died trying to rescue her dog from an icy pond.</p><p>WZZM reports Tracy Cashman, 38, was reported missing Saturday around 9 p.m. after not returning home from walking her dog in the town of Wyoming.</p><p>MLive reports family members began searching for Cashman when her dog returned home without her. They were unable to find her, prompting them to call police for help.</p><p>Just after midnight, search crews discovered Cashman's body in the ice of a pond at the park. Firefighters tried unsuccessfully to revive her.</p><p>Investigators believe that Cashman fell through the ice trying to rescue her dog after it fell through the ice during their walk.</p><p><br></p>"
      },
      "publishedAt": "2018-12-10T13:15:13.848Z",
      "tag": ["learning", 
      "CMS", "React"]
    },
    {
      "id": "ef615f0b-d30f-4753-822d-9607d2e078ca",
      "__typename": "Post",
      "title": "Homeowner devastated after losing roommate, home, dog to house fire",
      "content": {
        "html": "<p>SAN ANTONIO - A single knock on his bedroom door is what changed 62-year-old William Golden’s life as he would soon learn that he’d lose his home, his dog and his roommate he said was like a brother to him.</p><p>The fire broke out in the 900 block of Saddlebrook Drive. San Antonio fire officials say they got the call after midnight Sunday and were&nbsp;told by an unidentified person that a home was up in flames, but that all of the residents made it out safely. However, when they got to the scene, they found a 64-year-old man deceased in a bathroom of the home.</p><p>“He moved in, I believe, in late August,” Golden said. “I knew him because we used to work together but we would always get up early on the weekends. I just remember it was around 7:30 that night when he said he was going to go to bed early because he had to get up early for work.”</p><p>Golden said he was in his room across the hallway from his roommate’s room when everything began to happen so suddenly.</p><p>“I was watching TV and then I heard him banging on my door and I heard him scream ‘Fire!’ I opened my door and I didn’t see any flames but I saw a lot of smoke. It was really intense,” Golden said.</p><p>He said he immediately ran outside and grabbed the water hose.</p><p>“All I could think of and concentrate on was putting the fire out,” Golden said. “So I sprayed all across the top of the house and at one time I looked in the window and I saw flames in the rooms so I started squirting the water through the window.”</p><p>Shortly later, Golden said the fire officials arrived.</p><p><br></p>"
      },
      "publishedAt": "2018-12-10T13:15:27.855Z",
      "tag": ["animals"]
    }
  ]
}